In [1]:
import sys, os
sys.path.append(os.path.abspath("../"))  
import pandas as pd
from core.factors import *

In [2]:
df = pd.read_parquet("../data/twse_2020_to_2025.parquet")

In [3]:
df

       market stock_id       date    open    high     low   close    volume
0        TWSE     1101 2020-01-02   43.80   44.15   43.80   44.10  18470566
1        TWSE     1101 2020-01-03   44.15   44.25   43.45   43.95  18387114
2        TWSE     1101 2020-01-06   43.50   43.70   43.30   43.45  13867625
3        TWSE     1101 2020-01-07   43.45   43.60   43.20   43.60  14185347
4        TWSE     1101 2020-01-08   43.15   43.55   43.15   43.40  13465670
...       ...      ...        ...     ...     ...     ...     ...       ...
163288   TWSE     9958 2025-09-01  183.50  185.00  175.00  178.00   3488965
163289   TWSE     9958 2025-09-02  178.50  179.50  175.00  176.00   2021527
163290   TWSE     9958 2025-09-03  176.50  177.50  173.00  173.00   1930029
163291   TWSE     9958 2025-09-04  174.50  176.50  173.50  173.50   1379901
163292   TWSE     9958 2025-09-05  176.00  176.00  172.50  174.00   1334284

[1319597 rows x 8 columns]

In [4]:
stock_ids = df["stock_id"].astype(str).unique().tolist()
len(stock_ids), stock_ids[:10]

(997,
 ['1101',
  '1102',
  '1103',
  '1104',
  '1108',
  '1109',
  '1110',
  '1201',
  '1203',
  '1210'])

In [5]:
import requests
import pandas as pd

url = "https://openapi.twse.com.tw/v1/opendata/t187ap03_L"
data = requests.get(url).json()
df_twse = pd.DataFrame(data)[["公司代號", "公司名稱", "產業別"]]
df_twse.columns = ["stock_id", "name", "sector"]
df_twse["stock_id"] = df_twse["stock_id"].astype(str)
df_twse.head()

  stock_id        name sector
0     1101  臺灣水泥股份有限公司     01
1     1102  亞洲水泥股份有限公司     01
2     1103  嘉新水泥股份有限公司     01
3     1104  環球水泥股份有限公司     01
4     1108  幸福水泥股份有限公司     01

In [6]:
df_twse

     stock_id          name sector
0        1101    臺灣水泥股份有限公司     01
1        1102    亞洲水泥股份有限公司     01
2        1103    嘉新水泥股份有限公司     01
3        1104    環球水泥股份有限公司     01
4        1108    幸福水泥股份有限公司     01
...       ...           ...    ...
1061     9944    新麗企業股份有限公司     20
1062     9945  潤泰創新國際股份有限公司     20
1063     9946    三發地產股份有限公司     14
1064     9955  佳龍科技工程股份有限公司     35
1065     9958  世紀鋼鐵結構股份有限公司     10

[1066 rows x 3 columns]

In [7]:
df = df.merge(df_twse[["stock_id", "sector"]], on="stock_id", how="left")

In [9]:
df.to_parquet('../data/twse_2020_to_2025_sector.parquet')

In [10]:
df

,market,stock_id,date,open,high,low,close,volume,sector
0,TWSE,1101,2020-01-02,43.80,44.15,43.80,44.10,18470566,01
1,TWSE,1101,2020-01-03,44.15,44.25,43.45,43.95,18387114,01
2,TWSE,1101,2020-01-06,43.50,43.70,43.30,43.45,13867625,01
3,TWSE,1101,2020-01-07,43.45,43.60,43.20,43.60,14185347,01
4,TWSE,1101,2020-01-08,43.15,43.55,43.15,43.40,13465670,01
...,...,...,...,...,...,...,...,...,...
1319592,TWSE,9958,2025-09-01,183.50,185.00,175.00,178.00,3488965,10
1319593,TWSE,9958,2025-09-02,178.50,179.50,175.00,176.00,2021527,10
1319594,TWSE,9958,2025-09-03,176.50,177.50,173.00,173.00,1930029,10
1319595,TWSE,9958,2025-09-04,174.50,176.50,173.50,173.50,1379901,10
1319596,TWSE,9958,2025-09-05,176.00,176.00,172.50,174.00,1334284,10